In [1]:
!pip install pymongo pandas

Defaulting to user installation because normal site-packages is not writeable
Collecting pymongo
  Downloading pymongo-4.15.3-cp310-cp310-manylinux2014_x86_64.manylinux_2_17_x86_64.manylinux_2_28_x86_64.whl (1.2 MB)
     ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 1.2/1.2 MB 2.3 MB/s eta 0:00:00m eta 0:00:010:01:01
Collecting pandas
  Downloading pandas-2.3.3-cp310-cp310-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl (12.8 MB)
     ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 12.8/12.8 MB 1.5 MB/s eta 0:00:00m eta 0:00:01[36m0:00:01
Collecting dnspython<3.0.0,>=1.16.0
  Downloading dnspython-2.8.0-py3-none-any.whl (331 kB)
     ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 331.1/331.1 KB 1.6 MB/s eta 0:00:00m eta 0:00:010:01:01
Requirement already satisfied: python-dateutil>=2.8.2 in ./.local/lib/python3.10/site-packages (from pandas) (2.9.0.post0)
Collecting numpy>=1.22.4
  Downloading numpy-2.2.6-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (16.8 MB)
     ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 16.8/16.8 MB 2.2 MB/s eta 0:00:00m eta 0:00:01[36m0:00:01
Requirement already satisfied: tzdata>=2022.7 in ./.local/lib/python3.10/site-packages (from pandas) (2025.2)
Requirement already satisfied: pytz>=2020.1 in /usr/lib/python3/dist-packages (from pandas) (2022.1)
Requirement already satisfied: six>=1.5 in /usr/lib/python3/dist-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: numpy, dnspython, pymongo, pandas
Successfully installed dnspython-2.8.0 numpy-2.2.6 pandas-2.3.3 pymongo-4.15.3

In [2]:
# Latihan 1

from pymongo import MongoClient

# Inisialisasi client dan koneksi ke database
client = MongoClient('mongodb://localhost:27017/')
db = client['company_db']
collection = db['employees']

# Contoh untuk memastikan koneksi
print('Connected to MongoDB')

Connected to MongoDB

In [24]:
collection.delete_many({})
print("üßπ Semua data di koleksi berhasil dihapus!")

üßπ Semua data di koleksi berhasil dihapus!

In [25]:
# Latihan 2

# Insert satu data
employee_data = {
    'name': 'Alice',
    'department': 'Finance',
    'age': 29,
    'salary': 4500
}
collection.insert_one(employee_data)
print("1 data berhasil dimasukkan")

1 data berhasil dimasukkan

In [26]:
# Tugas 2

import pandas as pd
import random

# Generate 120 data karyawan acak 
names = ["Bob", "Charlie", "Diana", "Eve", "Frank", "Grace", "Henry", "Ivy", "Jack"]
departments = ["Finance", "IT", "HR", "Marketing", "Sales"]
data = []

for i in range(120):
    employee = {
        "name": random.choice(names),
        "department": random.choice(departments),
        "age": random.randint(22, 50),
        "salary": round(random.uniform(3500, 9000), 2)
    }
    data.append(employee)

# Insert ke MongoDB 
collection.insert_many(data)
print(f"{len(data)} data karyawan berhasil dimasukkan\n")

# Update dan Delete contoh 
# Tambah 5% gaji untuk semua karyawan IT
collection.update_many({'department': 'IT'}, {'$mul': {'salary': 1.05}})

# Hapus semua karyawan dengan gaji < 4000
collection.delete_many({'salary': {'$lt': 4000}})

# Ambil semua data hasil akhir 
final_data = list(collection.find({}, {"_id": 0}))

# Ubah jadi DataFrame 
df = pd.DataFrame(final_data)

# Tampilkan hasil tabel 
print("Data Karyawan Setelah Operasi Update & Delete:\n")
display(df)

# Tampilkan ringkasan jumlah per departemen 
print("\nJumlah karyawan per departemen:")
print(df["department"].value_counts())

120 data karyawan berhasil dimasukkan

Data Karyawan Setelah Operasi Update & Delete:

        name department  age     salary
0      Alice    Finance   29  4500.0000
1        Bob    Finance   32  6013.5000
2        Eve    Finance   36  4850.5700
3    Charlie         HR   33  6011.7200
4        Eve  Marketing   43  7093.7400
..       ...        ...  ...        ...
102    Grace      Sales   38  4624.0600
103    Grace    Finance   39  4372.6600
104    Grace  Marketing   44  6801.9000
105     Jack      Sales   24  8985.0300
106  Charlie         IT   37  6668.2455

[107 rows x 4 columns]

Jumlah karyawan per departemen:
department
IT           33
HR           22
Finance      18
Marketing    18
Sales        16
Name: count, dtype: int64

In [27]:
# Contoh Query Data (Tampilan dalam bentuk JSON) 
for employee in collection.find():
    print(employee)

{'_id': ObjectId('6902ebdc8003addf6c3548a6'), 'name': 'Alice', 'department': 'Finance', 'age': 29, 'salary': 4500}
{'_id': ObjectId('6902ec7e8003addf6c3548a7'), 'name': 'Bob', 'department': 'Finance', 'age': 32, 'salary': 6013.5}
{'_id': ObjectId('6902ec7e8003addf6c3548a8'), 'name': 'Eve', 'department': 'Finance', 'age': 36, 'salary': 4850.57}
{'_id': ObjectId('6902ec7e8003addf6c3548a9'), 'name': 'Charlie', 'department': 'HR', 'age': 33, 'salary': 6011.72}
{'_id': ObjectId('6902ec7e8003addf6c3548aa'), 'name': 'Eve', 'department': 'Marketing', 'age': 43, 'salary': 7093.74}
{'_id': ObjectId('6902ec7e8003addf6c3548ac'), 'name': 'Diana', 'department': 'Marketing', 'age': 37, 'salary': 4748.74}
{'_id': ObjectId('6902ec7e8003addf6c3548ad'), 'name': 'Eve', 'department': 'IT', 'age': 33, 'salary': 6311.4555}
{'_id': ObjectId('6902ec7e8003addf6c3548ae'), 'name': 'Jack', 'department': 'IT', 'age': 49, 'salary': 8388.2505}
{'_id': ObjectId('6902ec7e8003addf6c3548af'), 'name': 'Ivy', 'department': 'IT', 'age': 39, 'salary': 5993.4315}
{'_id': ObjectId('6902ec7e8003addf6c3548b0'), 'name': 'Henry', 'department': 'Finance', 'age': 31, 'salary': 7019.16}
{'_id': ObjectId('6902ec7e8003addf6c3548b1'), 'name': 'Frank', 'department': 'Finance', 'age': 45, 'salary': 6238.08}
{'_id': ObjectId('6902ec7e8003addf6c3548b2'), 'name': 'Diana', 'department': 'Marketing', 'age': 34, 'salary': 7936.77}
{'_id': ObjectId('6902ec7e8003addf6c3548b4'), 'name': 'Frank', 'department': 'IT', 'age': 35, 'salary': 7891.884}
{'_id': ObjectId('6902ec7e8003addf6c3548b5'), 'name': 'Bob', 'department': 'Finance', 'age': 23, 'salary': 6950.32}
{'_id': ObjectId('6902ec7e8003addf6c3548b6'), 'name': 'Bob', 'department': 'Marketing', 'age': 48, 'salary': 4783.21}
{'_id': ObjectId('6902ec7e8003addf6c3548b8'), 'name': 'Diana', 'department': 'Sales', 'age': 33, 'salary': 5146.88}
{'_id': ObjectId('6902ec7e8003addf6c3548b9'), 'name': 'Ivy', 'department': 'HR', 'age': 49, 'salary': 7207.42}
{'_id': ObjectId('6902ec7e8003addf6c3548ba'), 'name': 'Ivy', 'department': 'Sales', 'age': 32, 'salary': 6839.33}
{'_id': ObjectId('6902ec7e8003addf6c3548bb'), 'name': 'Eve', 'department': 'Sales', 'age': 50, 'salary': 5941.91}
{'_id': ObjectId('6902ec7e8003addf6c3548bc'), 'name': 'Bob', 'department': 'HR', 'age': 23, 'salary': 7511.82}
{'_id': ObjectId('6902ec7e8003addf6c3548bd'), 'name': 'Bob', 'department': 'Marketing', 'age': 28, 'salary': 4033.42}
{'_id': ObjectId('6902ec7e8003addf6c3548be'), 'name': 'Charlie', 'department': 'Sales', 'age': 31, 'salary': 7703.78}
{'_id': ObjectId('6902ec7e8003addf6c3548bf'), 'name': 'Charlie', 'department': 'Finance', 'age': 49, 'salary': 7845.76}
{'_id': ObjectId('6902ec7e8003addf6c3548c0'), 'name': 'Henry', 'department': 'HR', 'age': 25, 'salary': 8248.81}
{'_id': ObjectId('6902ec7e8003addf6c3548c2'), 'name': 'Jack', 'department': 'IT', 'age': 37, 'salary': 7714.4445000000005}
{'_id': ObjectId('6902ec7e8003addf6c3548c3'), 'name': 'Ivy', 'department': 'IT', 'age': 50, 'salary': 8178.7545}
{'_id': ObjectId('6902ec7e8003addf6c3548c4'), 'name': 'Ivy', 'department': 'IT', 'age': 43, 'salary': 5047.1085}
{'_id': ObjectId('6902ec7e8003addf6c3548c5'), 'name': 'Henry', 'department': 'IT', 'age': 50, 'salary': 9417.114000000001}
{'_id': ObjectId('6902ec7e8003addf6c3548c6'), 'name': 'Grace', 'department': 'HR', 'age': 38, 'salary': 8474.09}
{'_id': ObjectId('6902ec7e8003addf6c3548c7'), 'name': 'Grace', 'department': 'HR', 'age': 36, 'salary': 4932.02}
{'_id': ObjectId('6902ec7e8003addf6c3548c8'), 'name': 'Frank', 'department': 'HR', 'age': 32, 'salary': 8247.68}
{'_id': ObjectId('6902ec7e8003addf6c3548c9'), 'name': 'Ivy', 'department': 'Finance', 'age': 28, 'salary': 4605.78}
{'_id': ObjectId('6902ec7e8003addf6c3548ca'), 'name': 'Charlie', 'department': 'Sales', 'age': 47, 'salary': 7628.75}
{'_id': ObjectId('6902ec7e8003addf6c3548cb'), 'name': 'Ivy', 'department': 'Finance', 'age': 33, 'salary': 6054.47}
{'_id': ObjectId('6902ec7e8003addf6c3548cc'), 'name': 'Diana', 'department': 'IT', 'age': 47, 'salary': 4875.759}
{'_id': ObjectId('6902ec7e8003addf6c3548ce'), 'name': 'Jack', 'department': 'Marketing', 'age': 48, 'salary': 5707.28}
{'_id': ObjectId('6902ec7e8003addf6c3548cf'), 'name': 'Charlie', 'department': 'HR', 'age': 50, 'salary': 4261.61}
{'_id': ObjectId('6902ec7e8003addf6c3548d0'), 'name': 'Eve', 'department': 'Sales', 'age': 26, 'salary': 4183.11}
{'_id': ObjectId('6902ec7e8003addf6c3548d1'), 'name': 'Eve', 'department': 'IT', 'age': 22, 'salary': 6635.349}
{'_id': ObjectId('6902ec7e8003addf6c3548d3'), 'name': 'Bob', 'department': 'Sales', 'age': 23, 'salary': 6391.53}
{'_id': ObjectId('6902ec7e8003addf6c3548d4'), 'name': 'Grace', 'department': 'Finance', 'age': 35, 'salary': 8525.5}
{'_id': ObjectId('6902ec7e8003addf6c3548d5'), 'name': 'Grace', 'department': 'IT', 'age': 46, 'salary': 5357.5830000000005}
{'_id': ObjectId('6902ec7e8003addf6c3548d6'), 'name': 'Bob', 'department': 'HR', 'age': 24, 'salary': 6470.76}
{'_id': ObjectId('6902ec7e8003addf6c3548d7'), 'name': 'Diana', 'department': 'Sales', 'age': 26, 'salary': 8347.25}
{'_id': ObjectId('6902ec7e8003addf6c3548d9'), 'name': 'Henry', 'department': 'IT', 'age': 41, 'salary': 6182.3475}
{'_id': ObjectId('6902ec7e8003addf6c3548da'), 'name': 'Eve', 'department': 'IT', 'age': 38, 'salary': 4980.7905}
{'_id': ObjectId('6902ec7e8003addf6c3548db'), 'name': 'Ivy', 'department': 'Marketing', 'age': 36, 'salary': 8104.75}
{'_id': ObjectId('6902ec7e8003addf6c3548dc'), 'name': 'Bob', 'department': 'IT', 'age': 44, 'salary': 8881.95}
{'_id': ObjectId('6902ec7e8003addf6c3548dd'), 'name': 'Charlie', 'department': 'Sales', 'age': 33, 'salary': 5495.97}
{'_id': ObjectId('6902ec7e8003addf6c3548de'), 'name': 'Bob', 'department': 'IT', 'age': 47, 'salary': 6692.2695}
{'_id': ObjectId('6902ec7e8003addf6c3548df'), 'name': 'Jack', 'department': 'Finance', 'age': 43, 'salary': 8476.16}
{'_id': ObjectId('6902ec7e8003addf6c3548e0'), 'name': 'Eve', 'department': 'Marketing', 'age': 35, 'salary': 6046.06}
{'_id': ObjectId('6902ec7e8003addf6c3548e1'), 'name': 'Charlie', 'department': 'Sales', 'age': 30, 'salary': 5326.63}
{'_id': ObjectId('6902ec7e8003addf6c3548e2'), 'name': 'Ivy', 'department': 'IT', 'age': 30, 'salary': 5936.595}
{'_id': ObjectId('6902ec7e8003addf6c3548e3'), 'name': 'Bob', 'department': 'HR', 'age': 22, 'salary': 8369.38}
{'_id': ObjectId('6902ec7e8003addf6c3548e4'), 'name': 'Charlie', 'department': 'HR', 'age': 35, 'salary': 7728.27}
{'_id': ObjectId('6902ec7e8003addf6c3548e5'), 'name': 'Grace', 'department': 'HR', 'age': 29, 'salary': 6128.37}
{'_id': ObjectId('6902ec7e8003addf6c3548e6'), 'name': 'Eve', 'department': 'IT', 'age': 29, 'salary': 8602.597500000002}
{'_id': ObjectId('6902ec7e8003addf6c3548e7'), 'name': 'Bob', 'department': 'HR', 'age': 49, 'salary': 4930.35}
{'_id': ObjectId('6902ec7e8003addf6c3548e8'), 'name': 'Charlie', 'department': 'Sales', 'age': 48, 'salary': 7389.3}
{'_id': ObjectId('6902ec7e8003addf6c3548e9'), 'name': 'Henry', 'department': 'Marketing', 'age': 36, 'salary': 6038.34}
{'_id': ObjectId('6902ec7e8003addf6c3548ea'), 'name': 'Grace', 'department': 'IT', 'age': 33, 'salary': 4580.289000000001}
{'_id': ObjectId('6902ec7e8003addf6c3548eb'), 'name': 'Jack', 'department': 'HR', 'age': 49, 'salary': 6798.63}
{'_id': ObjectId('6902ec7e8003addf6c3548ec'), 'name': 'Diana', 'department': 'IT', 'age': 24, 'salary': 5657.5785000000005}
{'_id': ObjectId('6902ec7e8003addf6c3548ed'), 'name': 'Ivy', 'department': 'Finance', 'age': 26, 'salary': 6275.26}
{'_id': ObjectId('6902ec7e8003addf6c3548ee'), 'name': 'Frank', 'department': 'Marketing', 'age': 50, 'salary': 5215.88}
{'_id': ObjectId('6902ec7e8003addf6c3548ef'), 'name': 'Henry', 'department': 'Finance', 'age': 36, 'salary': 5258.04}
{'_id': ObjectId('6902ec7e8003addf6c3548f0'), 'name': 'Ivy', 'department': 'IT', 'age': 43, 'salary': 8150.5305}
{'_id': ObjectId('6902ec7e8003addf6c3548f1'), 'name': 'Charlie', 'department': 'Finance', 'age': 26, 'salary': 7018.17}
{'_id': ObjectId('6902ec7e8003addf6c3548f2'), 'name': 'Jack', 'department': 'HR', 'age': 31, 'salary': 6842.83}
{'_id': ObjectId('6902ec7e8003addf6c3548f3'), 'name': 'Henry', 'department': 'HR', 'age': 49, 'salary': 8538.55}
{'_id': ObjectId('6902ec7e8003addf6c3548f6'), 'name': 'Jack', 'department': 'Marketing', 'age': 48, 'salary': 4173.39}
{'_id': ObjectId('6902ec7e8003addf6c3548f7'), 'name': 'Jack', 'department': 'Finance', 'age': 41, 'salary': 7271.31}
{'_id': ObjectId('6902ec7e8003addf6c3548f8'), 'name': 'Diana', 'department': 'IT', 'age': 27, 'salary': 5846.0955}
{'_id': ObjectId('6902ec7e8003addf6c3548f9'), 'name': 'Frank', 'department': 'Sales', 'age': 33, 'salary': 6580.22}
{'_id': ObjectId('6902ec7e8003addf6c3548fa'), 'name': 'Charlie', 'department': 'Marketing', 'age': 24, 'salary': 5168.82}
{'_id': ObjectId('6902ec7e8003addf6c3548fb'), 'name': 'Ivy', 'department': 'Marketing', 'age': 34, 'salary': 6030.64}
{'_id': ObjectId('6902ec7e8003addf6c3548fc'), 'name': 'Henry', 'department': 'IT', 'age': 35, 'salary': 6006.987}
{'_id': ObjectId('6902ec7e8003addf6c3548fd'), 'name': 'Bob', 'department': 'IT', 'age': 39, 'salary': 7360.773}
{'_id': ObjectId('6902ec7e8003addf6c3548fe'), 'name': 'Charlie', 'department': 'Marketing', 'age': 50, 'salary': 7617.21}
{'_id': ObjectId('6902ec7e8003addf6c354900'), 'name': 'Frank', 'department': 'Sales', 'age': 39, 'salary': 6538.02}
{'_id': ObjectId('6902ec7e8003addf6c354902'), 'name': 'Diana', 'department': 'IT', 'age': 27, 'salary': 6669.138000000001}
{'_id': ObjectId('6902ec7e8003addf6c354903'), 'name': 'Ivy', 'department': 'Marketing', 'age': 23, 'salary': 5756.42}
{'_id': ObjectId('6902ec7e8003addf6c354905'), 'name': 'Eve', 'department': 'IT', 'age': 44, 'salary': 4918.4835}
{'_id': ObjectId('6902ec7e8003addf6c354906'), 'name': 'Frank', 'department': 'HR', 'age': 26, 'salary': 7971.85}
{'_id': ObjectId('6902ec7e8003addf6c354907'), 'name': 'Jack', 'department': 'Marketing', 'age': 49, 'salary': 8230.9}
{'_id': ObjectId('6902ec7e8003addf6c354908'), 'name': 'Frank', 'department': 'HR', 'age': 24, 'salary': 8187.79}
{'_id': ObjectId('6902ec7e8003addf6c35490a'), 'name': 'Frank', 'department': 'Marketing', 'age': 33, 'salary': 7141.97}
{'_id': ObjectId('6902ec7e8003addf6c35490b'), 'name': 'Grace', 'department': 'HR', 'age': 31, 'salary': 5349.09}
{'_id': ObjectId('6902ec7e8003addf6c35490c'), 'name': 'Henry', 'department': 'Sales', 'age': 40, 'salary': 8708.37}
{'_id': ObjectId('6902ec7e8003addf6c35490d'), 'name': 'Bob', 'department': 'Finance', 'age': 41, 'salary': 6070.88}
{'_id': ObjectId('6902ec7e8003addf6c35490e'), 'name': 'Henry', 'department': 'IT', 'age': 31, 'salary': 4572.1410000000005}
{'_id': ObjectId('6902ec7e8003addf6c35490f'), 'name': 'Grace', 'department': 'IT', 'age': 37, 'salary': 6227.413500000001}
{'_id': ObjectId('6902ec7e8003addf6c354910'), 'name': 'Grace', 'department': 'HR', 'age': 26, 'salary': 8436.13}
{'_id': ObjectId('6902ec7e8003addf6c354911'), 'name': 'Eve', 'department': 'IT', 'age': 48, 'salary': 7961.1315}
{'_id': ObjectId('6902ec7e8003addf6c354912'), 'name': 'Eve', 'department': 'IT', 'age': 31, 'salary': 4660.4355000000005}
{'_id': ObjectId('6902ec7e8003addf6c354913'), 'name': 'Eve', 'department': 'IT', 'age': 39, 'salary': 4828.236}
{'_id': ObjectId('6902ec7e8003addf6c354914'), 'name': 'Henry', 'department': 'HR', 'age': 36, 'salary': 7987.21}
{'_id': ObjectId('6902ec7e8003addf6c354915'), 'name': 'Frank', 'department': 'Finance', 'age': 27, 'salary': 8855.79}
{'_id': ObjectId('6902ec7e8003addf6c354916'), 'name': 'Charlie', 'department': 'IT', 'age': 30, 'salary': 8025.9165}
{'_id': ObjectId('6902ec7e8003addf6c354917'), 'name': 'Jack', 'department': 'HR', 'age': 43, 'salary': 7658.88}
{'_id': ObjectId('6902ec7e8003addf6c354919'), 'name': 'Eve', 'department': 'IT', 'age': 35, 'salary': 7176.876}
{'_id': ObjectId('6902ec7e8003addf6c35491a'), 'name': 'Grace', 'department': 'Sales', 'age': 38, 'salary': 4624.06}
{'_id': ObjectId('6902ec7e8003addf6c35491b'), 'name': 'Grace', 'department': 'Finance', 'age': 39, 'salary': 4372.66}
{'_id': ObjectId('6902ec7e8003addf6c35491c'), 'name': 'Grace', 'department': 'Marketing', 'age': 44, 'salary': 6801.9}
{'_id': ObjectId('6902ec7e8003addf6c35491d'), 'name': 'Jack', 'department': 'Sales', 'age': 24, 'salary': 8985.03}
{'_id': ObjectId('6902ec7e8003addf6c35491e'), 'name': 'Charlie', 'department': 'IT', 'age': 37, 'salary': 6668.2455}

In [28]:
# Tampilan dalam bentuk tabel

import pandas as pd

# Ambil semua data dari koleksi tanpa _id
data = list(collection.find({}, {'_id': 0}))

# Ubah jadi DataFrame biar tampil seperti tabel
df = pd.DataFrame(data)

# Tampilkan hasil tabel
print("Data Karyawan:")
display(df)

üìã Data Karyawan:

        name department  age     salary
0      Alice    Finance   29  4500.0000
1        Bob    Finance   32  6013.5000
2        Eve    Finance   36  4850.5700
3    Charlie         HR   33  6011.7200
4        Eve  Marketing   43  7093.7400
..       ...        ...  ...        ...
102    Grace      Sales   38  4624.0600
103    Grace    Finance   39  4372.6600
104    Grace  Marketing   44  6801.9000
105     Jack      Sales   24  8985.0300
106  Charlie         IT   37  6668.2455

[107 rows x 4 columns]

In [29]:
# Latihan 3 (Dalam bentuk JSON)

# Query Aggregation untuk mencari rata-rata gaji per departemen
pipeline = [
    {'$group': {'_id': '$department', 'average_salary': {'$avg': '$salary'}}}
]
for result in collection.aggregate(pipeline):
    print(result)

{'_id': 'Finance', 'average_salary': 6455.6338888888895}
{'_id': 'HR', 'average_salary': 7104.239090909091}
{'_id': 'Marketing', 'average_salary': 6146.08}
{'_id': 'IT', 'average_salary': 6557.513772727273}
{'_id': 'Sales', 'average_salary': 6614.38375}

In [30]:
# Dalam bentuk tabel 

import pandas as pd

# Aggregation: hitung rata-rata gaji per departemen
pipeline = [
    {'$group': {'_id': '$department', 'average_salary': {'$avg': '$salary'}}}
]
results = list(collection.aggregate(pipeline))

# Ubah hasil ke DataFrame
df = pd.DataFrame(results)

# Ubah nama kolom agar lebih jelas
df.rename(columns={'_id': 'Department', 'average_salary': 'Average Salary'}, inplace=True)

# Tampilkan tabel hasil rata-rata gaji
print("üìä Rata-rata Gaji per Departemen:")
display(df)

üìä Rata-rata Gaji per Departemen:

  Department  Average Salary
0    Finance     6455.633889
1         HR     7104.239091
2  Marketing     6146.080000
3         IT     6557.513773
4      Sales     6614.383750

In [31]:
# Latihan 4.1 (Buatlah koleksi baru products dan masukkan data produk (minimal 10 produk).

from pymongo import MongoClient
import pandas as pd

# Koneksi ke MongoDB
client = MongoClient("mongodb://localhost:27017/")
db = client["company_db"]
products = db["products"]

# Data produk minimal 10 item
product_list = [
    {"name": "Laptop ASUS", "category": "Electronics", "price": 12000000, "stock": 10},
    {"name": "Smartphone Samsung", "category": "Electronics", "price": 8000000, "stock": 20},
    {"name": "Headphone Sony", "category": "Accessories", "price": 1500000, "stock": 50},
    {"name": "Keyboard Logitech", "category": "Accessories", "price": 750000, "stock": 40},
    {"name": "Mouse Razer", "category": "Accessories", "price": 650000, "stock": 35},
    {"name": "Kursi Gaming Secretlab", "category": "Furniture", "price": 6000000, "stock": 5},
    {"name": "Meja Kantor IKEA", "category": "Furniture", "price": 3500000, "stock": 8},
    {"name": "Monitor LG", "category": "Electronics", "price": 2500000, "stock": 15},
    {"name": "Printer Canon", "category": "Electronics", "price": 2200000, "stock": 12},
    {"name": "Webcam Logitech", "category": "Accessories", "price": 950000, "stock": 30}
]

# Insert ke koleksi
products.insert_many(product_list)
print("10 data produk berhasil dimasukkan!")

# Tampilkan semua data dalam tabel
df_products = pd.DataFrame(list(products.find({}, {'_id': 0})))
display(df_products)

10 data produk berhasil dimasukkan!

                     name     category     price  stock
0             Laptop ASUS  Electronics  12000000     10
1      Smartphone Samsung  Electronics   8000000     20
2          Headphone Sony  Accessories   1500000     50
3       Keyboard Logitech  Accessories    750000     40
4             Mouse Razer  Accessories    650000     35
5  Kursi Gaming Secretlab    Furniture   6000000      5
6        Meja Kantor IKEA    Furniture   3500000      8
7              Monitor LG  Electronics   2500000     15
8           Printer Canon  Electronics   2200000     12
9         Webcam Logitech  Accessories    950000     30

In [32]:
# Latihan 4.2 (Lakukan query untuk menemukan produk dengan harga di atas rata-rata.)

# Hitung rata-rata harga
avg_price = list(products.aggregate([
    {'$group': {'_id': None, 'average_price': {'$avg': '$price'}}}
]))[0]['average_price']

print(f"Rata-rata harga produk: Rp{avg_price:,.0f}\n")

# Cari produk dengan harga di atas rata-rata
above_avg = list(products.find({'price': {'$gt': avg_price}}, {'_id': 0}))

# Tampilkan hasil dalam tabel
df_above_avg = pd.DataFrame(above_avg)
print("Produk dengan harga di atas rata-rata:")
display(df_above_avg)

Rata-rata harga produk: Rp3,805,000

Produk dengan harga di atas rata-rata:

                     name     category     price  stock
0             Laptop ASUS  Electronics  12000000     10
1      Smartphone Samsung  Electronics   8000000     20
2  Kursi Gaming Secretlab    Furniture   6000000      5

In [33]:
# Latihan 4.3 (Buatlah aggregation pipeline untuk menghitung total produk dalam setiap kategori.)

# Pipeline aggregation
pipeline = [
    {'$group': {'_id': '$category', 'total_products': {'$sum': 1}}}
]

category_counts = list(products.aggregate(pipeline))

# Tampilkan hasil dalam bentuk tabel
df_category = pd.DataFrame(category_counts)
df_category.rename(columns={'_id': 'Category', 'total_products': 'Total Products'}, inplace=True)

print("Jumlah produk per kategori:")
display(df_category)

Jumlah produk per kategori:

      Category  Total Products
0    Furniture               2
1  Accessories               4
2  Electronics               4